Datathon FME 2022

In [149]:
import pandas as pd
import numpy as np
import math

In [150]:
df_cities = pd.read_csv(r"C:\Users\Álex\Documents\Datathon\data\datathonfme2022-main\datathonfme2022-main\accenture_challenge\datathon_SC_ACN_22\cities_data.csv", sep=";", encoding="UTF-8")
df_orders = pd.read_csv(r"C:\Users\Álex\Documents\Datathon\data\datathonfme2022-main\datathonfme2022-main\accenture_challenge\datathon_SC_ACN_22\orders.csv", sep=";", encoding="UTF-8")

In [151]:
df_cities.head()

,city_from_name,city_to_name,city_from_coord,city_to_coord,distance
0,Dusseldorf,Zaragoza,"(51.2254018, 6.7763137)","(41.6521342, -0.8809428)",1214.4772
1,Dusseldorf,Venlo,"(51.2254018, 6.7763137)","(51.39244885, 6.1511724144122955)",47.3876
2,Dusseldorf,Bratislava,"(51.2254018, 6.7763137)","(48.1516988, 17.1093063)",819.2894
3,Dusseldorf,Hamburg,"(51.2254018, 6.7763137)","(53.550341, 10.000654)",339.2215
4,Dusseldorf,Rome,"(51.2254018, 6.7763137)","(41.8933203, 12.4829321)",1125.0290

In [152]:
df_orders.head()

,order_id,origin_port,3pl,customs_procedures,logistic_hub,customer,product_id,units,late_order
0,366c7a3d298f,Rotterdam,v_002,DTP,Venlo,Marseille,1692723,583,True
1,45f906331e10,Rotterdam,v_004,CRF,Rome,Marseille,1644308,459,False
2,ac84a6e4af0f,Athens,v_002,CRF,Venlo,Paris,1684170,464,True
3,f5e98cb29790,Rotterdam,v_004,CRF,Lille,Milan,1620510,678,False
4,a9e7c9bee35b,Barcelona,v_002,CRF,Venlo,Berlin,1699372,353,False

## Feature Engineering

In this step we added some interesting features to the dataset such as the distance or the type of material being handled

In [153]:
distances = []
for i in df_orders.values:
    dist = ((df_cities[(df_cities["city_from_name"] == i[1]) & (df_cities["city_to_name"] == i[4])]["distance"].values) or (df_cities[(df_cities["city_from_name"] == i[4]) & (df_cities["city_to_name"] == i[1])]["distance"].values))
    if (dist):
        distances.append(dist[0])
    else:
        distances.append(0)

C:\Users\Álex\AppData\Local\Temp\ipykernel_23520\886607660.py:3: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  dist = ((df_cities[(df_cities["city_from_name"] == i[1]) & (df_cities["city_to_name"] == i[4])]["distance"].values) or (df_cities[(df_cities["city_from_name"] == i[4]) & (df_cities["city_to_name"] == i[1])]["distance"].values))
C:\Users\Álex\AppData\Local\Temp\ipykernel_23520\886607660.py:4: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if (dist):

In [154]:
df_orders["dist_to_hub"] = distances

In [155]:
df_orders.head()

,order_id,origin_port,3pl,customs_procedures,logistic_hub,customer,product_id,units,late_order,dist_to_hub
0,366c7a3d298f,Rotterdam,v_002,DTP,Venlo,Marseille,1692723,583,True,130.0459
1,45f906331e10,Rotterdam,v_004,CRF,Rome,Marseille,1644308,459,False,1269.2365
2,ac84a6e4af0f,Athens,v_002,CRF,Venlo,Paris,1684170,464,True,2029.5726
3,f5e98cb29790,Rotterdam,v_004,CRF,Lille,Milan,1620510,678,False,173.9644
4,a9e7c9bee35b,Barcelona,v_002,CRF,Venlo,Berlin,1699372,353,False,1153.4178

## Plottings

In [156]:
import matplotlib.pyplot as plt